docs/posts/2015-01-13-a-parents-love.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A Parents Love</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">A Parents Love</h1>
<p class="subtitle" role="doc-subtitle">Jan 13, 2015</p>
</header><p>
Saturday afternoon, protestors lined the bridge at Rogers Avenue and Interstate 44 in Lawton, Oklahoma. They held signs demanding that the children currently detained for illegal immigration be sent back to their home countries.
</p>

<p>
<a href="http://www.npr.org/2014/07/17/332251674/as-immigration-crisis-grows-a-protest-movement-gains-steam">National Public Radio</a> recently reported on another protest:
</p>

<blockquote>
<p>
This week outside the southern Arizona town of Oracle, Marla and Bruce Bemis — along with several dozen of their neighbors — were lined up along a road waving American flags and holding signs, as patriotic music occasionally played in the background. Word had come that the federal government was planning to bring some of the detainees to a local academy for troubled youth.
</p>

<p>
&ldquo;You know it&rsquo;s a shame that they&rsquo;re kids, if they&rsquo;re kids, but I guess their parents didn&rsquo;t care that much to send them on that journey to here,&rdquo; says Marla Bemis.
</p>
</blockquote>

<p>
This brought to mind the story of Moses:
</p>

<blockquote>
<p>
A man from the family of Levi married a Levite woman. The woman became pregnant and had a son. She saw there was something special about him and hid him. She hid him for three months. When she couldn&rsquo;t hide him any longer she got a little basket–boat made of papyrus, waterproofed it with tar and pitch, and placed the child in it. Then she set it afloat in the reeds at the edge of the Nile. (Exodus 2:1-3)
</p>
</blockquote>



<p>
How much love must it take to send one&rsquo;s child into the unknown? These are parents who care very much indeed.
</p>


<p>
God of love,<br>
<br>
Jesus took a little child<br>
into his arms, and said,<br>
&ldquo;Whoever welcomes a child<br>
in my name, welcomes me.&rdquo;<br>
<br>
There are days<br>
when the Kingdom seems so near,<br>
but others when it seems so far.<br>
<br>
Today, as the death toll rises<br>
in the land where<br>
the Prince of Peace once walked,<br>
help me to honor your words<br>
with more than just my lips.<br>
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="org7e41f9d">
<p>
Tagged: <a href="../tags/ethics.html">Ethics</a> <a href="../tags/politics.html">Politics</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
